src/Documents/ImportedProducts/ImportedProducts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ImportedProducts</name>
  <registerRecords>AccumulationRegister.RemainingProducts</registerRecords>
  <attributes>
    <name>Storage</name>
    <type>
      <types>EnumRef.Storage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Products</name>
    <attributes>
      <name>Nomenclature</name>
      <type>
        <types>CatalogRef.Nomenclature</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/RemainingProducts/RemainingProducts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>RemainingProducts</name>
  <resources>
    <name>Quantity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Price</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Nomenclature</name>
    <type>
      <types>CatalogRef.Nomenclature</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Storage</name>
    <type>
      <types>EnumRef.Storage</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ImportedProducts/ObjectModule.bsl
Procedure Posting(Cancel, Mode)
	//{{__REGISTER_REGISTERRECORDS_WIZARD
	// This fragment was built by the wizard.
	// Warning! All manually made changes will be lost next time you use the wizard.

	// register RemainingProducts Receipt
	RegisterRecords.RemainingProducts.Write = True;
	For Each CurRowProducts In Products Do
		Record = RegisterRecords.RemainingProducts.Add();
		Record.RecordType = AccumulationRecordType.Receipt;
		Record.Period = Date;
		Record.Nomenclature = CurRowProducts.Nomenclature;
		Record.Storage = Storage;
		Record.Quantity = CurRowProducts.Quantity;
		Record.Price = CurRowProducts.Price;
	EndDo;

	//}}__REGISTER_REGISTERRECORDS_WIZARD
EndProcedure
